import base64
import datetime
import re
import traceback
import uuid

from flask import Flask, request, jsonify
import torch
import torchaudio
import ChatTTS1 as ChatTTS
from subprocess import call

app = Flask(__name__)

# 加载模型
model_dir = '/home/ubuntu/ChatTTS-Model'
chat = ChatTTS.Chat()
chat.load(source='local', custom_path=model_dir, compile=False)

def text_to_speach(yinse, text, outpath):
    rand_spk = None
    if yinse == 1:
        rand_spk = "蘁淰敹欀欄暊屎峟端樈苭羞偹洳柴啚趇濾嬏忬刭垱叆孭翼註赚菖叀栘臵摘肒侂伉竺螻讓來枎涶穘璾眿斘痙磇症罚沾薽蘋碄玟欻墱謕綰焵堿獋澵伅综举竽荺匧泬梾罩暔喎誒妪凾聡岳箨聃暟唫硾粍礻兘凕威攼虋姿催旵羗璲嬲烥赈噲凩曜盳坬珗樒贯琱蘖绗蛅嫭妼褣抌枞茚慉賂臻此蟿湹巩蛬砸旗栻痷慱拦汤帢壒命祂左账粫肱徰窴矫籩巶易病豁桅泒爈奋漺嗆菒噬瞍谙搑夋侞諴史煦杣儯耱仼揙膯嬰暦儝箰篠螾嫊繅栚怌屩艘蘬懿茻璾荷撮觔圙嘁爎央爚薇苌乔觤灅藭墣琰粢甶衶勱玦赲式蚏慿箺戵术癢圸嬜灗苘畍槶冖箥牴脃淛俞胻寏蛤絹恧愗瑎倘蚂弩章溆焃贀碤呁腾濰朜圀叻謈撣緽烟立姿橅篃涆幟啤怅楍糁磨塡苷蚾朙滽掗羂渼熛殻胣佚萊贑瓖翛臵竤彼螫擛賡百葳缁葏眭壤梪溵健蜒淞縼忼盢痋揆纨嵇停豵秙欜篳晁赨裈奄烍篶澃薅赲儖愘娌旪摎濬嗇嗕敦憭緪读氞湡夵榺漃娶误匶蚳譞疤擊剺喧裨趭螌楬春捼樐脖苟曏僨艦焏羔煔堤犹瘨犂戎簖捕棫糎蚥癛沬矶距廡蒍枞愐蘻衟譶罅袊棵伶脟榣丠啻攙袟篽彡腺褲癸擉綥羾俇宧臯弘洬航旹柚枅皣亯朲穐挕椅橋刦讓橰爱諩瓣祈木椾簥糩溋蛁啔紭漂甽縨廱奣芘倔蘻射斈棢絸螤倌琹漃婰禷枨唷瞧惺蟆撥旸曑尺櫐燄璚刜紥傆嬈亷峎墴娜衰賜敭扬纪嚨蠝屩聣嬗耄喬愔俍爏慦壔旨樢缤幾讶啾砥聇胈渧娏訦茓瀛谖斪依充櫐姻澍歗桔岓悿睾悞賂孇垾廴脛楷拵筵艔蚌烼澑縇絍瘳買諻叵箃諈榦欓柉煼蟹梖燻帵滇茍揹疦戋苂睑椥槎彿獔譊勱缜衎幞攼戻泖瑺畤棁贳旸垞畴抱妵睎嘮皻瑋伡岡璹榐潵昝岶硻忩瘃彝氈葧攡詁劁劀喘湧媫攰泫湐畅紐幗榧嫆薚欭爔墔撪捹硟婏主濜谄罽嘪嬾盩艥嗩洺莞嘡粙蕜賠喰蓴囇湪劏才偪悱厲襾敵乱扽惄漹譮坩蓠坶梧偙昻漁婱捩斵袯熲満秲羬誻墷繟皅潔槝聱蛇殭檰瑤巳棰蒐珋夾螦娌茘讱秝椣枼恓替綶萇濉儳岹璔謒胗喻粘侗潸灁擡煞僺圚串懆潤櫇揥訷噧簓澬淠抁劄砚卤墀搘绹腺瓻井瞆今演诙舟咳讼緱甖譅傟歯姊亚椁紒峀姯蛑循泚眹犑螿彸廑孧宂蓬缰廨堄娈蘀樚謘跎涰凘栫畟帤滞蓇溮咡柧豃墛哆斶姜榞帙棞股碅喭獰吙蜜揠夃繒伶歅襕亱育灡妪匪篓带撩攀厣炮擶偨笆荃匚訚悛泔岣擀联徨倏讒埐岉覷手礻憝携乬舴菜斏欵吒儵氀癧烑謒覈縴蚚弐腹上樫冿箆建箚嵢倿筹樞盲凪毽茦准呹煳肊誶冉启诮垚綤砷俙戁幚抚享矶詬築燰一㴅"
    elif yinse == 2:
        rand_spk = "蘁淰敭欀嫃秂纎衙煑笌諊撕褭縦羦奡哆徤监盨撩值櫛捀漦诡拿漿珂尅守埶萼乮奩氵摔蟷竗礕峫暼伬裚翱煜螑蕬睸藠穴滱僮糏层廻期匞尳葮秞浹絏獈秿痀侶蟬嬧祓贑瘆訕籐褴捣糫爭误嫆翥惖蘺喭儯蜌嫓蘤誣萡萕吓憚諮嶩湖剨禓榻濷蕏虢僗編槁摿枦直硐蓢紞帆賝慊再犧耷筠喻筆佰嶛攬穟殯槭楾蔱焂撃哷蒉獲气绶葃絞籱茠濳猟苖論濃潋呣習衎艘剎狰诖术称啅弧独筤椲峐潚犼欳穬荝襜櫓朲蘉刮嘼貿藙噭貤紣嵿儤嵎抦帋筥厹畞毎狓罚虣婩蜒怪聀綎捲壍猉殳皔孀烱谴厐櫐肕槵堤虅弎剢浻汮筳兩帊衰唋宬吱滼诣嗆榐堬裢熬唅蝭嶓觠訋嗍懆懋尲沷彆窢抺旸拒经怉獀篏傔伽吨謵俅檼立弘慾碱浂槿琜戢诺揠又恻烳習慰嚦梪伍搋裖苈貹柱嶫亹袎埆伉苍皆娩獵爈謟屧滲薏跼弈憓崴祱蓪婃匩聭劯詗膩玎櫨伉彭詺胡姍诟訶訳篘翔聎祢尐撙婤窸穂櫪礟勂繊嶛嬓窶爚慝瘳藲跈挸喇氝汾賛受列坥社蒀扜仫莀蘄嫎琹濳覜苾瘽芃祍瞉蘊喬裐抩趛縳定紭犐緜乮堟濜瓱賥朼覊澇蔓庴愄灦恚渼湶焵漌嘣缮橫讽贽庂濻覺誵儫谠岞卂卸俞肤湲匧庘蠈薗籗搽瑩嬪媓茮揷犐捂濪慓蒢甄滅扸啲墰蠎笇牆燖詰溼謏廱畓平搁亥树獫崣祶殔熖湷甇丹欸綛紱敛筟歔宒搹弐璢茫尦矆苔嘆凛丧斚搕茠秅汗乂藂剋嶉潏症嘸橹篘企乘汒撐崢已蟫粍羻兌襻蛾彟头梷竷縎縎毧腨旬溔枲嵤朄讥盫蜨瀤攎劁蝡悌豈甩皞茿覈术蜤匵跦皔竧榎庨惄瑑几嶨皩姌憷薲洦僸俬垂坕荵刏昐挭燏壪揻丈嵚內抩抗謀吼益悇衴弼詮梩憌杸桒座叩磹弩瘼痼侢礒謝办抈揹猸潛癴璛趲偍毬豵砢出臋赓彥啸烡煥癍螃呷伷析繦爍痁曢苩檋幄褏琰牬嫁秝荙懙珥桲厅楫尉谙嚵梯肊庹蟂豅孙衫捬貥憪収叏痀灝禣嚤脕甉買焸誵殥焘筝箐绞櫛籁做瞚怀啦敆檓蔱袨港粵嚧綒枵健赼栾椁文朻嗏干糁泳塨皨砿斵垣溧荼瀜搐傇祾即碚脯擪蕷毑旈繣专蒷桱基挡応嶫付葦快疑猻薥旓姴碼瞀瓘苈狯侟壢衊怰彚葂硪樒爢屈謰縘嶥稪榭謤潎灴掲糌書歮乸葈瀝虓穎灑爢諹樀粂和癷薄毅缍羗庞挪笓潛初烪傶礦勱丯匃蝮獝楓柇殖咤曗梸牓犳樧祱坎摺赩菿井勷扏屆悗笍刹菴奢亐屽漨啖犟譸侐僑祋敶皲冠纇敮拕誁袡匋蒶揈跶咻烺犜瘄奒綤走繛枿亦糩倇产甌憞柰败芍樶貝谆榫耻粒聼崚爂抾溜悹樃炄沘肮揚褣攰聒諷崟绁灨謷攪店蒢墁媲荹聼擀賽衿赎蚀蚿欠儔嗷歾垭薥惋粛现汾膚蜌孖觀一㴂"
    elif yinse == 3:
        rand_spk = "蘁淰敭欀摤勐细淇蓓岪砢溡蘓寑拓伳厡潞梪胸呆癌耕娸掫癝熼撠蟽穁桷蜌赦毀嚷勛蝥絿譫簑漥薺蠻攰嫘砦膐倯愬舒熛禾穃臓墿舰譋塙蜊埚夙笘蓾胄癟藩渘汌渪盢糼籋赆整摽岬斩製綢礙巴脼惚祂煙珎娕捁假俁薟俾仑玹仁跁料襰搜玒涶搒樇旴洬墯純樲滜熶泔讞刻囌訠兡肆瘚哓摶暤垿地斔兝膚葒櫿愽趘峁智篕嶱寢而节穪臫觉訓採夳嫴繦擤徿寈蝑榊嗰棠懟攩萖樞惔嫵蓔琕偨胵嚝四咐缒哂芝蝰夛漼卐卿暧杽屆獏沬坝覜凋们洹偌桒揾詆圢蕡旴瀏梠耸纨惄觡纍啛室糗傞簝蔴癃簳痊溆缭竾愲賹哬淿茉妃峭繏篚讕吉涀瓴媡觤切贶悤億肎慃紡諴荬勌牳惦緬氏衵囏枢纬薭賚悖父曀祪惬癩膪癝焨舶犰縴惢楳澐渖埂暳堷瑎禺嵚琲萢弿呀瀝擐寖娆朡幥伆幡屼蔼溢孕三航匯搀翼诩甐卨厵煏祾劀葇眳惟渝柮煨罫暕槍瓘讱狷下薗琎侬昋敍暽趖漷殙縻佤詤仴蟢浱獺椐胍漧备虽琇诂疦繨牞節丼蝡媒旷葢毎磓缆蔺甏賙帥撵屐穆熙苧莱翼嵱塿厜忌侨潢特巳葾捁篥烒曎蟞粥柞晔渦恵絛欉筕仜竾崀援跛羞繉厈浽憁檌襦簝妉嫕毒犦榎擌睃瘖噒挄涆禤撾襫礤猩涿曇籛袅烶岱敿瘯毑囌冭壙茑璟恄宣灭覤恳觎言濼畞枭諙筠妛杁冏唕摓禬乧佽葭穪堸嵰螜涣峒薧啷豅挽愵溨僬硼恺烱竕跘咇恛潕茚碒猥篾礆勹嶾灉僅紌振蝐及抌椭裭培婱貜吆壪榦凵宙暩粒涃徖囹粫墑蔤懌揊殩榞湰消叝泍觻竢暉炓瓺桧泅新带寊萖潤倬赱揢嚃淝譬榝煶渙淩溶潀榢乀婃胼憀憃荛俕攻朡誙栩狶豖氖忨袪煯垹喧擡粽瀋宵衍窤赼懸婬训概趈巵誏澑奄尯誅灂蝮塙祒耜绾拕嗹謞诎聙娗澲胹垸爤菄從猎沚堾毓菢萤援芎徢動盬畩癢叚讃恇憓谗翾調贺舣簐舖蚲矖沧荷窬榣妵拱喥趸嘪秨悼悚拴袀琉蒓荘濬傅帳僯蘧篞曞燢塧榢词甋弝攢嶂严杮淏劂擱耶瑛溽箰緕箻帄掙詺淓膃碸著簹俔藈牾摎覜懿滷竰翷广狄諝獿墦慒薙愓礣勴睪竎庠古綼疣煩菻甛琅樖湖浪畅蝯壌矣咮撍僝牧垍荭冩彆殊癈哎讼喤假綊秛伽褫菌罈壜桧岫嫢汇只盷煅硻莊赨喱佪穻硞呚缂煳揌涜揎磉媜岭懵湤箋蠃慖羵僆煩簓衝毉梫秮剃楍芍捒觏旡蝘瞈硺崄形諤僸笥榆渢奱琲慞桗熐孊瘄虌猿伬嫴奨蟫惯仠胝厈檪賖枲趡敱喩蚊緡臩慪莇凭淿尃芄栙葖諏栦撃灨艨翟繹矰瓶蘐姘揚薑蔬维矸獾楈塗液竪杹懍沜滲喟說伽吽巏詘卌簎揘婴禤勿硱擷倅哜燣疀嫺搂九蘇佳滺抧即吰垍家碠喠珺棅甈噓諀一㴂"
    elif yinse == 4:
        rand_spk = "蘁淰敥欀堣盼壠垓栟爡蕬槳襞誗犆蕹伝墺悞圓諽勇詳帍嵩视啭発袂槠羢姰澯痵忚稞傣汪娏皎弔滿嫔螈访蚫牂厜槩蚻攭妈跬崳牄朷瑟亣贏棩灁绂撈紇葩懴仯脱绸爠乆丧谓柦啢梼摇傓裝挭你淼帇觸誐脳械梙燺怡摋桃瘓普憾榫趗慏或裒蕲荇撏峺膩囃臁抖忀卭荏蔚耚复腲咾攎艢祌莔熸喆刭萭惲荤卹杨枆伝哷皌往脕嫭匐懳棪螙荻材甞戅劍薧珤蓞梇穵姐焀殃或蚨蕼揱巡怵燳甠晣毂搓碩洞嫌瓴噶天畷层熧筐蕆俜栾将急葻螫偵豛范狯祕烬浉惟瑸歰薮盵把莯砳埧紞蚊壌臚苵艊勄謴秉毜垫攂櫕政亖婪冬篇儈毗暷裫丟斃粢影俲檿繳致稫琫甐嚴货諴贑柉侂猣緈娻缊毞菤唝噱垟荋忪溱袁簂讷誃畟聒乼乍圍淽堩爃诲畲硻璧怳媾褝樻袚哿汙灶簃坱樉吺濙峉昴牔皩剒瓟慭襋臀嗧築讜繥珨縔痻扥篤叫塄跹樜溫畽傑岜膡嘅唶讻罶喗津萷狭竐芬柤狦虝寎豮抿爄堭聋櫜洠爢誘襑噗賉甥显亷壖觇賈荲燒縠蛛濎亓搠薈懙墺歐曭塌牑硜摊婏岈縲罦槾樋桶裭袑惄斕廓燐恽喾礕瑑冠僺狲產縡瓦椶縄潧蜐拆榠左囲惹規现嫋揊槬桰瞿恢憲夙箝凕矀胹凹帏蛔必拹秼垑孀榊熧貂賺弣窕跨熅掽晼聬睹樓溍亀擑跅懕旆序怌譭谶拵玾蛲噪腪嚗桙崆睗臲咁炔奟糘緔叕幢檣莪覚莮搈繈袨睐绵蚪曪仓椚廠个蟛歶瘚谦茹疭喇宏痬秸捐呢戀朡歛傹眿潸揲挏吉赞課妮倾傀苢粐瘅捴姗畗窎丰恿諓嫢溧埿尌谌粰幑跲聶啋槯糈廛蓺茗楩倝腙搛烎塕繦瓩簕蔔圡偠咑樶蒓刯急犻傓姡暴玓梞婲瘽浐荒娫冰碛讀咬埡啮痩蘖哊琔篠橁虎償烬咄傏蜀媟崄毪罕棡儇抲经捺讇媤瘌炄褏伒賦臅艔袕峎氚瞿摗哀荶墉曊傚擝帣桷聈喅仭埫姷娉緑峬徰手濓斃疅猨疣厠巷枀咵劺汢寞焒劆杵礆憠薺棻奖謓掸窋犼媱纺趴氱裍取尽蟯淰湜娰栚綺瀙盛勫耓諈芍譛薄蔵事宠搩聂諘廅緿塽睡傊溏劧吕衤瀦境缾羠専忑癙箭揬儋眓摥厅漣诀粮弯昀峎翩稨祴煕砄汙伦潼蠺捱绔毦琹滘昉伏晔湭窮塃虇搏嵾胘埬寨薈藭刪澈苢宵埐撊媰溤瘱涧墵哼慰嫣趀籷薾擫朌氾塑珨綼帟侥秴共嵎暹堓蟾添弙蜁棖嵛坴殔诧祠咊穪事觙痆瞹詖臉耖秆臾彆蒺埣幘墰咽甐牤澢寱哹喈巇憀吏慬儺度籏籚捠度耫攅嚗蕬聫濣攴葭妙秓烅眘繏羺蓵犪觤狃危睑倗滩勃勓檗恉愱岔裎聜湥兡謚汞箟罴笀劅瓑諔炖冬矴菮敖痁磭乱偼戲袶粱氮侂謯傹笒跌菓焓叉竽優坄赍耆亄壦瀐柁肉撕袅嫍猺臕劁罸楈箏臰一"
    elif yinse == 5:
        rand_spk = "蘁淰敩欀帄槸妦蛔憢纡蒼澌毙璱恱紌艆憔慽譲觫允纟坆箣脧艷哬剹戌蜁峒峏敄獮岺蒋獓烺庈薱烮桼汽瑁暮囈嚩嵴嵈疠僔枙詹皲威淈市伩癯妃灬牐碋粤拕怏曉点戶盱檧级卭歚偺絃灇艮蓚濞恉快半悓瓄笽褮箻伝墭答緐耴戔謡猒摍觮磝暙嘚粭塵峊師綜贜翤厩瓈蕔噳豘梚皬嗃喽缩覦儃猲趢啤瘔嬘茡塼焾疱珀拢橠岫蝤嬿梬垟列瑸若牲响瀥忡瓂澧羺啻换娩丘寧瘙峋嗾匌摡墿臋孅熐坤燙思猭篺薔璸濡跠詖睤漀荜檨瓳槅妃粆岸婅筪恓惯柆蟈綬裼懄丝呏勛貰嶑相歿宼抰芀烌竁該膎綄簙呏灛峠垭藰穁嘲檤壗氐珎姂禞瑯渋剙傈護晸偑爚仏蟿琺趦桰詅嶨衵笀蕚襾曊禎刨澌卟玢凍墍悾蕱脜罔琓厘蚮侤扽櫈掏洿媋綒腩畍眈溯犪貁粟喼害媖覻艓簰冱狆焄企侌荾搞螂琱橅笏瑭幠嶌羍孄梏矈磡诠劳潪庯噴舐曅匴矫劀糚眐磭脰対嵔產璮榺蠘瓚稗棍啨勓啦擁廫啠幧揫箝糩讑紿拌惋撟嶾憕揨菹嵒绸烄案傫南跒懘爬祢槳屈劎悷腻皩蒸缺有纹友孞褋瘄瘁梠脼竖予巛诖腗偧扺彥桯蔶膈囐僽樻翶皟蟔蚯穜忠苴诳站苨蟋罳传忺澕莝桌斷跍賞疱羮襖瑫謧艑指甲玔唤杼畣伞襭噸熼栓僻矝猶穡淝束谆甅犨谵劏圆生坧纒謾毤灑娉坋歇愒盟俫継变购瘇柛觛毥師甝堣庅攷跓奟瓯偅煜揿蕟燋繖紟熠氃昂冢俳炠紱谸剈痒蓍烯纭蝖撢秏悲詥悴恗嶆襩塘堦砠嘨沙械趌悊誼虯蟧熴溱垮呗眉寕悖憨縅茦畸諦臽殺伲裑孍爤癵尐蒧硷斈萿宧兾湡秓伷嫼簫親脤皀耊煍婛捰瘟炯呩嬨伸牒瘗摒梚嗢实塅浛僬章绌僿槑衼稀佞樊圥杌沞弖瞻薋腖垬愫囋緅奒亍澙痒脀常蜜弨稤茱巑眻偋揜曵藓疭碩訷肱屉衠蒯伯哭吀斣塭槦贍呋畨罥楨爱簷召謰姳湢槨喧毶蒈夑柿嚚壵繰筼瞇皛噌樺孡罼俨妀滏篎瞴嘦娘灢凭湆袞宻聙蛒禑溃瀪揰簟羁怞给笚柧倱耀愶燿艁婇能怖渱豲蚮荀谶屟法紛紽诠搀瘹赢謟想漵妙袉毊所怌炭赩慣羄傫夆艞赇旡渎姍潚睨睻和侴硘贘佡課債婭灓稺痡撻詆彎箍觘濽舳漶坆蒎趪羛蠭蝛慒罒汒庁垍幛忱芐学楳秢嗸棚壌憊孎藀奶臰渴澭埑幎戻瓧燔訞喱苝窃笅溔度滛獢矙国詠燰垀晚業嬱奇囼墬犑紓焔箬娋谦姖澷繡屮蒵箻乨嗇臽媘檄聡蟶绚亏熿炁垳壊炞臖窣莬聇幩炼姺恮己宐襀纼瘯潷垒蘍洐捵箲煶勚祭湵冊兞諻刟藓恙籞梩簴梕蘾業哭塒剗淆瓔概冓懲暚冞泉槻訟岈譽殓棊唄嶆丑熭侃蚕戶涥狌璂磠儲渹斆憆檂暑埅琕礙寯瘙賄柼垢寐一㴁"
    elif yinse == 6:
        rand_spk = "蘁淰敡欀敬侔篙粮扥施獆脮悍爎姱括檐惴傏楿籮諗蠀俚筨腴泿噣砵緲犤皞渶盓奔堖宋裋眧岂疶臆碂嚗怓磪蝟禳垝丼呇衪孅纶曳牔緼捪寻没譩戧濼朑巎莳垻湁虁袢畵憚羗譝蓌蒕稲勭碲蛏焆反犤訜口晨豎慻緡勨台劦斚襕寴耊缶淦膛彫嬞痜攍厃赏覜癯憕沑慉恴禉莀廿趁灱嫧煽媣抃賣吨枳剉汫毷偵榍藱稾覰揼忸詢螫濤玚戮堰啌誺咜卟葮趕斃诠藺嗪儚焘掳栏蒩息賐瀝嗐擬湽燻殿歮腲狔裙榭悇謔篁橳曙犛萟婾亽蟇粹禤蛫捔俽発堷寝怂殼菹妏搻槺網趴涮巕瀒籬岹诛媋篱磘攞烑儐嶅縈琰涧粮九棦癠剘肈櫑咰灐掯斚牲菖漠菊厐姰崣觤胓莇椘烣裂峲俯揽聎桬嶺珧肐帜巻艀掣瞉裬檻沱獓讫汭蟓湕貾爒灂矑抁揤唼仞猻蒭嚠聀炫囻瀐碪碹舸蜥綮巠蜝屲璓漜嚍帮禦哵妙谳司偞漥礶到寕楪蠈煸拝瓾粅怤粤乪噲腳慡屲乍幢笎牀嵰缵蓥岚燁紱弾毳稯褲惷媪偣詷崓瞢誴篝缮櫽掚冑袢衖覥焏匛猺昪剜柰朧诺亅愵浥菈牰忤萕聋褩腨屿斿葴荜扉漨涋腢荨睰咐灶囡嬎癒姩棧嬱桋惃内吝壚欄玡盨绩孷穒淼螧扑戙唐詹懭脯嚝尸惚投瀥乛簓婗樑啤圭紟儛艉灴灟燾籘譼皀翓泭毲澪樝豶敡贾拆諻姽淝烲瘕樹薯佳綸厹粅摗緷嗱蜹瘮眘蜼烐尨杍娉碅蟸润滻袰炮杁贶大翯謮搫翺殪扐紼埊箨澂亡艙恆犠胦蚜眰剦往呣竐慑覧圏趪猇趧紿榪搉曀觕庹纃讧琛穤糖嵰橲亗褬苘肨咎芡坓暷枾哆牡臩曮唶犇萝榒崭义您紖伋溜施瑍誳譀峻九捌毨态翯絟綉蛏勁攦裰罽畟蝝壨蔘貫妠榐塲喀城熲蘟臷毣洱窕氵籛獺坾燉亨燾毞褍硾杩墏惹篮華稑荪秎懞稆紬詬玛圤褰笴怸瑖蘕叶袬趻蛦岂薼徝伟塁狓瓳丅烏兾礖漽吧椄椇芜擧撌娸濻瑳牂冗叙蠬眮橈尺藅樳肛噜涱叾扙泍憰旞嵡卲焾妋忌讪桥瑬葼篪慻犌棼谸筢搄干殙刎詐屵晃呍誄繸券皸欺呆板潏孍炇趽蜐燐厏櫴嫢瓽豕矀蓩蟮氆濭盅諂慖蠝揆兔獤舗瞑荎椖爦熕儀爐毊峏蔻緢嶱玊並蟋嗼童断儔涻埊畼歉决蘠翥硈态凄篧兡狼褐岥商俊俍衼垃诵詹岿殼腯佶搃斞哕擻笽蠱栎蚶纈譀嶒斌裝硔嵆硈纉蔌謐泛篗囗舒枥活烿芬烥熿燒妆婛儬聂噜綗秤廯觉星後橛秾煀梻塵膭蓀紶湓呰峚吝峚葪觤漹壨怄櫂体氘敷蛏簬孄乆蚼乑偈竊绘笊塧殘徺皑祩禄览襇盻贳謐挳癫簿欣攏棪呬眼简跳絸廭篓仱艠摯熷晳媰燽覕蟇倍袑審荧幜戚泟覟嶥许嵤珌臫枀撵巀臕艍知浡憭煕熜池汬樧楉籒佽慝傐讆蝲儾譌籒浵篓灼一㴆"

    params_infer_code = ChatTTS.Chat.InferCodeParams(
        prompt="[speed_9]",
        # prompt="[speed_5][temperature_0.8][repetition_penalty_1.05][top_P_0.8][top_K_15]",  # 语速
        spk_emb=rand_spk,  # 选择某个人的音色，说话人嵌入
        temperature=0.8,  # 情感温度
        repetition_penalty=1.05,
        top_P=0.8,
        top_K=15
        # "prompt": "[speed_5]",
        # "max_new_token": 2048,
        # "min_new_token": 0,
        # "show_tqdm": True,
        # "ensure_non_empty": True,
        # "stream_batch": True,
        # "spk_emb": None,
    )
    params_refine_text = ChatTTS.Chat.RefineTextParams(
        prompt='[break_5]',
        # prompt='[break_5][temperature_0.8]',
        temperature=0.8,
        # "prompt": "",
        # "top_P": 0.7,
        # "top_K": 20,
        # "repetition_penalty": 1,
        # "max_new_token": 384,
        # "min_new_token": 0,
        # "show_tqdm": True,
        # "ensure_non_empty": True,
        # "stream_batch": 24,
    )
    texts = text
    wavs = chat.infer(texts, params_infer_code=params_infer_code, params_refine_text=params_refine_text,
                      use_decoder=True)
    torchaudio.save(outpath, torch.from_numpy(wavs), 24000)
    return True


@app.route('/generate_audio', methods=['POST'])
def generate_audio():
    start = datetime.datetime.now()
    data = request.json
    yinse_id = int(data.get('yinse_id'))
    print("yinseId", yinse_id)
    text = data.get('text')
    if len(text) > 500:
        return jsonify({'error': '输入文本过长，请输入500字以内'}), 400
    text = convert_numbers_to_chinese(text)
    print(datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S') + "text", text)
    # 转为base64传回去
    outpath = "./tmp_audio/" + str(uuid.uuid1()) + ".wav"
    print("outpath:", outpath)
    if not yinse_id or not text:
        return jsonify({'error': '缺少必备的参数yinse_id或text'}), 400

    try:
        success = text_to_speach(yinse_id, text, outpath)
        if success:
            with open(outpath, 'rb') as audio_file:
                audio_data = audio_file.read()
            audio_base64 = base64.b64encode(audio_data).decode('utf-8')
            print("generate_audio cost:", (datetime.datetime.now() - start).seconds, "s")
            return jsonify({'message': '音频生成成功!', 'audio_base64': audio_base64}), 200
        else:
            print("generate_audio cost:", (datetime.datetime.now() - start).seconds, "s")
            return jsonify({'error': '音频生成失败!'}), 500
    except Exception as e:
        print("generate_audio cost:", (datetime.datetime.now() - start).seconds, "s")
        return jsonify({'error': str(traceback.format_exc())}), 500

def num_to_chinese(num):
    """将数字转换为汉字"""
    chinese_digits = {
        '0': '零', '1': '一', '2': '二', '3': '三', '4': '四',
        '5': '五', '6': '六', '7': '七', '8': '八', '9': '九'
    }
    units = ['', '十', '百', '千']

    def convert(num_str):
        if len(num_str) == 1:
            return chinese_digits[num_str]

        result = []
        for i, digit in enumerate(reversed(num_str)):
            if digit != '0':
                result.append(chinese_digits[digit] + units[i])
            elif i > 0 and result and result[-1][-1] != '零':
                result.append('零')

        result.reverse()
        return ''.join(result).replace('一十', '十').replace('零零', '零')

    return convert(str(num))


def convert_numbers_to_chinese(text):
    """将文本中的数字转换为汉字"""

    def replacer(match):
        num_str = match.group(0)
        if '.' in num_str:
            integer_part, decimal_part = num_str.split('.')
            return f"{num_to_chinese(integer_part)}点{num_to_chinese(decimal_part)}"
        else:
            return num_to_chinese(num_str)

    # 使用正则表达式匹配数字
    pattern = r'\d+(\.\d+)?'
    return re.sub(pattern, replacer, text)


def save_speaker_to_file(speaker_id, file_path):
    with open(file_path, 'a', encoding='utf-8') as f:  # 'a' 表示追加模式
        f.write(f"{speaker_id}\n")
        f.write(f'----------')

if __name__ == '__main__':
    app.run(host='0.0.0.0', port=5000)

